[
  {
    "id": 1,
    "title": "Lunar Life Support Challenge",
    "category": "Space & Engineering",
    "description": "Welcome to the Lunar Life Support Challenge! This bootcamp challenge is designed to push your creativity and technical skills to solve one of humanity’s greatest challenges: building sustainable life support on the Moon.\n\n■ Challenge Goals\n\n- Design a small-scale life support system that can provide breathable air, clean water, and food for astronauts.\n- Ensure system sustainability and ability to recycle resources.\n- Consider lunar conditions: low gravity, radiation, and extreme temperature changes.\n\n■ What You Need To Do\n\n- Form a team of 4–6 participants.\n- Brainstorm and propose a design for a lunar life support system.\n- Prepare a 5-minute presentation with diagrams, flowcharts, or prototypes.\n- Justify how your system works and survives lunar challenges.\n\n■ Evaluation Criteria\n\n- Innovation and creativity.\n- Technical feasibility.\n- Sustainability and efficiency.\n- Team collaboration and presentation quality.\n\n■ Resources (Display inside a styled card/box for emphasis)\n\n- NASA Official Website\n- NASA Space Apps Challenge\n- NASA Artemis Program\n- European Space Agency (ESA)\n- Indian Space Research Organisation (ISRO)\n\n■ Bonus Twist\nTeams can “stress test” each other’s systems by simulating disasters (oxygen leak, solar storm, dust contamination) and checking if the life support survives.",
    "difficulty": "Hard",
    "image": "lunar_life_support.jpg"
  },
  {
    "id": 2,
    "title": "Resource Management on a New Planet",
    "category": "Data Science",
    "description": "Welcome to the Resource Management Challenge! 🚀\n\nFuture space missions may involve establishing human colonies on planets or moons beyond Earth. In such environments, astronauts will need to manage critical resources — oxygen, water, food, and energy — without relying on resupply from Earth.\n\nA failure in resource management could mean the difference between survival and collapse of the colony.\n\n■ Challenge Goals\n\n- Develop a simulation or prototype system to manage essential resources in a planetary colony.\n- Model how resource availability changes over time with different population sizes and environmental conditions.\n- Enable decision-making by showing the impact of various choices (e.g., allocating more power to life support vs. exploration).\n\n■ What You Need To Do\n\n- Form a team of 4–6 participants.\n- Brainstorm and design a system that manages oxygen, water, food, and energy efficiently.\n- Create a simulation or prototype showing how resources are allocated and change over time.\n- Explain how your system handles unexpected events (new settlers, equipment failures, disasters).\n- Present your solution in a 5–7 minute pitch with diagrams, flowcharts, or a live demo.\n\n■ Potential Considerations\n\n- Environmental factors like dust storms, reduced solar power, or toxic atmosphere.\n- Population growth (new settlers arriving).\n- Equipment failures and how to recover.\n- Use of renewable sources (solar panels, algae-based oxygen production).\n- Balancing exploration vs. survival needs.\n\n■ Evaluation Criteria\n\n- Innovation & Creativity of the resource management approach.\n- Technical Feasibility of the proposed solution.\n- Sustainability & Efficiency in long-term survival.\n- Presentation Quality & Team Collaboration.\n\n■ Resources (inside styled card/box)\n\n- NASA Space Apps Challenge\n- NASA Artemis Program\n- European Space Agency (ESA)\n- Indian Space Research Organisation (ISRO)\n\n■ Bonus Twist\nTeams may be asked to stress test each other’s systems by simulating disasters such as:\n- Dust storm cutting off solar power.\n- Oxygen generator malfunction.\n- Sudden arrival of 50 new settlers.",
    "difficulty": "Medium",
    "image": "resource_management.png"
  },
  {
    "id": 3,
    "title": "Reducing Global Toxoplasmosis through Data and Innovation",
    "category": "Data & Innovation",
    "description": "Welcome to the Reducing Global Toxoplasmosis Challenge!\nToxoplasmosis is a parasitic disease caused by Toxoplasma gondii, affecting nearly one-third of the global population. It spreads mainly through contaminated food, water, soil, and contact with infected cats.\n\nThe disease is a major public health concern as it impacts:\n\nPregnant women, leading to birth defects.\n\nImmunocompromised individuals, causing severe illness.\n\nLivestock, leading to significant economic losses in agriculture.\n\nReducing its spread connects directly to the global themes of public health, food safety, and sustainable agriculture.\n\n■ The Challenge\n\nHow might we leverage NASA Earth observation data, innovative technologies, and global collaboration to reduce the prevalence and transmission of toxoplasmosis worldwide?\n\n■ Objectives\n\nDevelop tools that monitor and predict environmental hotspots for toxoplasmosis transmission.\n\nSupport farmers and public health officials with actionable insights for prevention.\n\nIncrease awareness and accessibility of toxoplasmosis-related data to global communities.\n\nHighlight scalable, cost-effective, and globally relevant solutions that integrate space data.\n\n■ Example Resources (inside styled card/box)\n\nNASA Earth Observation Data\n\nAppEEARS\n\nNASA Worldview\n\nFAO & WHO Reports on Food Safety and Zoonotic Diseases\n\nCDC Toxoplasmosis Resources\n\n■ Suggested Directions (Optional)\n\nCreate an AI-based early warning system predicting regions at high risk of toxoplasmosis outbreaks.\n\nDevelop a mobile app to educate farmers and communities on preventive practices.\n\nDesign a visualization platform combining satellite imagery with epidemiological data.\n\nCollaborate with public health agencies to link space data with medical interventions.\n\n■ Deliverables\n\nA prototype solution (mobile app, model, dashboard, or visualization tool).\n\nA storyboard/use case scenario explaining the beneficiaries and impact.\n\nA presentation (PowerPoint) summarizing the problem, solution, and scalability potential.",
    "difficulty": "Hard",
    "image": "toxoplasmosis.jpg"
  },
  {
    "id": 4,
    "title": "Space in the Classroom",
    "category": "Education",
    "description": "Welcome to the Space in the Classroom Challenge!\nThis challenge is designed to make science education more exciting and engaging by bringing real NASA data, space visuals, and interactive tools directly into classrooms.\n\n■ Background & Context\n\nScience education in schools faces several challenges:\n\nTraditional teaching methods often make science feel abstract, difficult, and boring.\n\nClassrooms lack engaging visual tools to explain complex concepts like planets, climate, and natural phenomena.\n\nThere is a gap between advanced scientific knowledge (e.g., satellite data) and what students actually experience in class.\n\n✨ NASA’s satellite imagery and data can help address these issues:\n\nReal-time Earth images show climate change, storms, fires, and pollution as they evolve.\n\nInteractive visuals spark curiosity, creativity, and critical thinking instead of rote memorization.\n\nSpace and climate data can connect students to global challenges, technology, and sustainability.\n\n👉 The challenge is to transform complex space data into fun, accessible, and interactive classroom tools that inspire students.\n\n■ The Challenge\n\nHow can we use NASA’s satellite data and imagery to develop interactive educational tools that bring space and climate sciences closer to students, making science more exciting, accessible, and inspiring inside classrooms?\n\n■ Objectives\n\nSimplify complex science concepts (e.g., climate change, water cycle) using real-world images and data.\n\nDesign interactive tools that encourage exploration and self-learning.\n\nCreate adaptable solutions for different education systems (local and international).\n\nSupport teachers with resources that make science easier to explain.\n\nInspire students to pursue STEM (Science, Technology, Engineering, Mathematics).\n\n■ Example Resources (inside styled card/box)\n\nNASA Worldview – real-time satellite imagery.\n\nNASA Education Resources – official content for schools.\n\nEO Kids – NASA’s child-friendly educational site.\n\nGLOBE Program – a NASA-supported global education initiative connecting students with environmental data.\n\nNote: These resources are available to participants but are not officially endorsed by NASA.\n\n■ Suggested Directions\n\nCreate a mobile app for students to explore planets and climate changes interactively.\n\nDevelop a space-themed educational game to make learning fun.\n\nDesign a classroom dashboard for teachers to integrate NASA data into lessons.\n\nBuild storytelling tools to explain natural phenomena like storms, volcanoes, or pollution.\n\nExplore VR/AR experiences to let students “visit space” or see Earth from orbit.\n\n■ Deliverables\n\nPrototype / Demo: App, game, dashboard, or VR/AR experience.\n\nStoryboard / Use Case: A scenario showing how students or teachers use the solution.\n\nPresentation: Summarize the problem, solution, and educational benefits.\n\n(Optional) Impact Projection: Estimate how the solution could improve education and inspire STEM interest.",
    "difficulty": "Medium",
    "image": "classroom.jpg"
  },
  {
    "id": 5,
    "title": "Tracking and Reducing the Risks of Space Debris",
    "category": "Space & Engineering",
    "description": "Welcome to the Space Debris Challenge!\nThis bootcamp challenge is designed to push your creativity and technical skills to tackle one of the biggest risks to our future in space: monitoring and reducing the dangers posed by space debris.\n\n■ Background & Context\n\nWhat is the main danger of space debris?\nDefunct satellites, rocket bodies, and debris orbit Earth at high speeds, threatening satellites, astronauts, and future missions.\n\nWhy should we care about it?\nEven small fragments can cause serious damage or mission failures.\n\nWhat are the wider impacts of this debris?\nCollisions in orbit that affect future space operations and sustainability.\n\n■ The Challenge\n\nHow might we use Earth observation and space monitoring data to track, analyze, and reduce space debris risks for current and future missions?\n\n■ Objectives\n\nProvide accurate tracking and visualization of space debris movement.\n\nSupport real-time decision-making for satellite operators.\n\nHighlight globally scalable solutions.\n\nEncourage innovative ideas for sustainable use of space.\n\n■ Deliverables\n\nPrototype/demo (application, dashboard, model, or visualization).\n\nStoryboard or use case scenario (who benefits and how).\n\nPowerPoint presentation summarizing the proposed solution.\n\n■ Resources (inside styled card/box)\n\nNASA Orbital Debris Program Office\n\nNASA Earthdata\n\nTools & APIs: Worldview, AppEEARS\n\nESA Reports and Datasets\n\n■ Evaluation Criteria\n\nInnovation and creativity\n\nTechnical feasibility\n\nSustainability and efficiency\n\nTeam collaboration and presentation quality\n\n■ Bonus Twist\n\nTeams can simulate debris collision scenarios such as:\n\nSatellite hit.\n\nFragment cloud expansion.\n\nEmergency response strategies to minimize risks.",
    "difficulty": "Hard",
    "image": "space_debris.jpg"
  },
  {
    "id": 6,
    "title": "Space Waste Watchers: Tackling Invisible Pollution",
    "category": "Environmental Science",
    "description": "■ Space Waste Watchers: Tackling Invisible Pollution\nWelcome to the Space Waste Watchers Challenge! This bootcamp challenge is designed to inspire innovative solutions that leverage Earth observation and space-based data to detect, track, and reduce the hidden threats of micro-scale pollution affecting our planet and our health.\n\n■ Background & Context\n\n- Every day, Earth is exposed to tons of micro-scale pollution caused by human activities—such as microplastics in the oceans and fine particulate matter in the air.\n- These pollutants are invisible to the naked eye, yet they have massive impacts on human health, food security, and climate change.\n- Communities, policymakers, and scientists all struggle to track and address these hidden threats.\n- Understanding and reducing this invisible pollution is crucial for protecting both people and the planet.\n\n■ The Challenge\n\nHow can we use Earth observation and space-based data to detect, track, and propose innovative solutions to reduce the impact of invisible pollution (such as microplastics or fine particulate matter) on communities and the environment?\n\n■ Objectives\n\n- Develop methods to monitor invisible pollution using satellite or open-source data.\n- Translate complex datasets into clear insights for decision-makers and the public.\n- Propose practical solutions to mitigate harmful effects.\n- Highlight global impact and scalability of the solution.\n\n■ Resources (Display inside a styled card/box for emphasis)\n\n- NASA Earthdata: Air quality & atmospheric data\n- MODIS & VIIRS satellite datasets: Imagery and pollutant tracking.\n- OpenAQ: Open-source air quality data.\n- Copernicus Marine Service: Ocean and microplastic data.\n- NASA Tutorials\n\n⚠️ Note: NASA does not endorse external resources, but participants may find them useful.\n\n■ Suggested Directions (Optional)\n\n- Create an interactive map showing microplastic accumulation or urban pollution levels.\n- Design an early warning system for high levels of fine pollution.\n- Build an educational visual storytelling tool to explain the issue to the public.\n- Develop a mobile app providing citizens with local pollution information.\n\n■ Deliverables\n\n- A prototype/demo (app, map, prediction model, or visualization).\n- A storyboard or use case scenario explaining who benefits and how.\n- A presentation (PowerPoint) summarizing the proposed solution.\n\n■ Evaluation Criteria\n\n- Innovation and creativity.\n- Technical feasibility.\n- Sustainability and scalability.\n- Team collaboration and presentation quality.",
    "difficulty": "Medium",
    "image": "space_waste.jpg"
  },
  {
    "id": 7,
    "title": "Monitoring Rising Sea Levels with Satellite Data",
    "category": "Data Visualization",
    "description": "■ Monitoring Rising Sea Levels with Satellite Data Welcome to the Sea Level Monitoring Challenge! This bootcamp challenge is designed to encourage innovative solutions that transform satellite data into meaningful insights, helping communities worldwide prepare for the growing risks of rising sea levels.■ Background Global sea levels are rising due to climate change, threatening millions of people living in coastal areas. NASA and other agencies collect satellite observations that measure sea level rise over time. Turning this raw data into meaningful insights can help communities prepare for future risks. ■ Objectives Build an interactive tool that visualizes historical sea level rise for specific regions using satellite datasets. Provide forecasts of sea level changes for the next decades based on current trends. Raise awareness of the impact on coastal cities and populations.\n■ Potential Considerations\n\n- What datasets are most reliable for sea level monitoring (e.g., altimetry satellites, GRACE data)?\n- How do you handle uncertainty in climate projections?\n- Could your tool highlight the most vulnerable regions or infrastructure?\n- What visualization techniques make complex scientific data accessible to the public?\n\n■ Expected Outcomes\n\n- A visualization platform (map, dashboard, or interactive chart) showing past and predicted sea level changes.\n- Documentation of the methodology and data sources used.\n- (Optional) A communication strategy for presenting the results to non-technical audiences.\n\n■ Resources\n\n- NASA’s Sea Level Change portal\n- Open datasets from NASA Earth Observations (NEO) and Copernicus\n- Tools: Plotly, D3.js, Tableau, or Python libraries (Matplotlib, Dash, Pandas)\n\n■ Evaluation Criteria\n\n- Innovation and creativity.\n- Technical feasibility.\n- Clarity of data visualization.\n- Team collaboration and presentation quality.",
    "difficulty": "Medium",
    "image": "sea_levels.png"
  },
  {
    "id": 8,
    "title": "Tackling Global Water Scarcity",
    "category": "Data & Innovation",
    "description": "Tackling Global Water Scarcity\nWelcome to the Water Scarcity Challenge! This bootcamp challenge is designed to inspire innovative solutions that leverage space-based data, technology, and collaboration to address one of humanity’s greatest threats: the global shortage of freshwater.\n\n■ Background & Context\n\n- Water scarcity is one of the most pressing global challenges of the 21st century, affecting billions of people worldwide.\n- Climate change, population growth, and unsustainable water management practices worsen the crisis, leading to severe droughts and reduced access to clean water.\n- This issue threatens food security, public health, economic stability, and overall human survival.\n- Farmers, city planners, policymakers, and vulnerable communities are among the most affected groups.\n- Addressing this problem is critical to achieving global sustainability and resilience.\n\n■ The Challenge\n\nHow might we use Earth observation data, innovative technologies, and global collaboration to mitigate water scarcity and ensure a sustainable supply of freshwater for future generations?\n\n■ Objectives\n\n- Monitor global freshwater sources and detect early signs of drought using satellite data.\n- Provide communities and farmers with real-time insights for efficient water management.\n- Develop scalable and cost-effective solutions to improve water conservation.\n- Promote policies and awareness that ensure long-term global water sustainability.\n\n■ Resources (Display inside a styled card/box for emphasis)\n\n- NASA Earth Observation Data\n- NASA GRACE Satellites for groundwater monitoring\n- NASA Worldview\n- United Nations Water Reports\n- FAO Aquastat\n\n■ Suggested Directions (Optional)\n\n- Build a mobile dashboard to track local and regional water availability.\n- Design AI models to predict future droughts and water crises.\n- Develop low-cost water purification and recycling systems.\n- Create global awareness campaigns supported by space-based data.\n\n■ Deliverables\n\n- A prototype solution (app, model, visualization, or monitoring tool).\n- A storyboard/use case scenario showing the impact on communities.\n- A presentation summarizing the challenge, solution, and global scalability.\n\n■ Evaluation Criteria\n\n- Innovation and creativity.\n- Technical feasibility.\n- Global impact and scalability.\n- Team collaboration and presentation quality.",
    "difficulty": "Hard",
    "image": "water_scarcity.jpg"
  },
  {
    "id": 9,
    "title": "Ever Given blocked the Suez Canal",
    "category": "Art & Culture",
    "description": "■ Ever Given Blocked the Suez Canal\nWelcome to the Suez Canal Challenge! This bootcamp challenge is designed to connect a real-world maritime crisis with the challenges of space exploration, showing how engineering, natural forces, and human decision-making can be explored creatively through STEAM (Science, Technology, Engineering, Art, and Math).\n\n■ Background & Context\n\n- In 2021, the cargo ship Ever Given became stranded in the Suez Canal, blocking one of the world’s most important trade routes for days.\n- The incident highlighted the complex interaction between engineering, natural forces, and human decision-making.\n- By connecting this real-world event to space science, participants can create an interdisciplinary STEAM project that engages audiences through science, art, and culture.\n\n■ The Challenge\n\n- Reinterpret a NASA or space agency science project through art, literature, or music, highlighting its design, process, or results.\n- Using the Suez Canal incident as inspiration, draw parallels with space missions’ navigation and engineering challenges, communicating the science in a creative and culturally meaningful way.\n\n■ Objectives\n\n- Translate a complex engineering problem into an accessible and engaging STEAM experience.\n- Show the impact of environmental forces and engineering decisions in both maritime and space contexts.\n- Highlight international collaboration, diversity, and cultural perspectives in problem-solving.\n\n■ Resources (Display inside a styled card/box for emphasis)\n\n- NASA mission pages on spacecraft navigation (e.g., Mars rovers, orbital satellites).\n- Data on the Ever Given incident: images, videos, and analysis of canal dynamics.\n- Artistic tools for storytelling (digital painting, animation, sound design, music composition).\n- Cultural research on international collaboration and diversity in STEM fields.\n\n■ Deliverables\n\n- A creative output (painting, digital art, short story, poem, or music piece) that parallels the Ever Given scenario with a space mission challenge.\n- A short written explanation (200–300 words) linking the scientific principles of navigation, engineering, and environmental forces to the artistic interpretation.\n- Optional multimedia elements (audio, video, interactive visuals) to enhance engagement.\n- Documentation of the cultural context, emphasizing teamwork, diversity, and global problem-solving.",
    "difficulty": "Creative",
    "image": "ever_given.png"
  },
  {
    "id": 10,
    "title": "Solar-Powered Pollution",
    "category": "Environmental Science",
    "description": "■ Solar-Powered Pollution\nWelcome to the Solar-Powered Pollution Challenge! This bootcamp challenge is designed to inspire innovative solutions that use Earth observation data and technology to understand and reduce the harmful impacts of sunlight on plastic waste in urban environments.\n\n■ Background & Context\n\n- Plastic pollution is one of the most pressing environmental issues of our time. While ocean plastics often receive attention, a large portion of plastic waste remains in urban environments — on streets, landfills, and open spaces.\n- Exposure to sunlight, especially ultraviolet (UV) radiation, breaks plastics down into microplastics and releases harmful chemicals. These particles can spread through air, soil, and water, entering food chains and threatening human health, biodiversity, and ecosystems.\n\nWhy does this issue matter?\n\n- Microplastics are inhaled and ingested by humans, with unknown long-term health impacts.\n- Soil contamination reduces fertility and affects food security.\n- Urban communities face greater exposure due to uncollected waste and high solar radiation.\n\nWho does it affect?\n\n- City residents (health + environment)\n- Municipalities and policymakers managing waste\n- Future generations inheriting polluted ecosystems\n\nLarger theme connection:\n\n- Climate change and sustainability\n- Human health and environmental justice\n- Clean cities and resilient ecosystems\n\n■ The Challenge\n\nHow might we use Earth observation data and innovative tools to understand and reduce the impacts of solar radiation on plastic waste in urban environments?\n\nDesign solutions that can analyze, visualize, or mitigate the harmful effects of sunlight on plastics in streets and cities.\n\n■ Objectives\n\n- Translate complex environmental data into accessible insights about plastic degradation.\n- Support decision-making for waste management and public health.\n- Be community- and policymaker-friendly.\n- Highlight scalability and global relevance (applicable to cities worldwide).\n\n■ Resources (Display inside a styled card/box for emphasis)\n\nNASA / Open Data Sets:\n\n- NASA POWER Project – solar radiation and meteorological data\n- Landsat & MODIS – land cover, urban heat islands\n- EOSDIS Worldview – real-time Earth observation data\n\nTools & APIs: AppEEARS, Earthdata API, Worldview API\n\nLearning Resources: NASA tutorials on Earth observation, research on plastic degradation and microplastics\n\nPartner Agencies / NGOs (optional): UNEP, local waste management organizations\n\n⚠️ Note: NASA does not endorse external resources, but participants may find them useful.\n\n■ Suggested Directions (Optional)\n\n- Build a mobile dashboard predicting plastic degradation hotspots in cities.\n- Create a simulation or model showing how fast plastics break down under different sunlight and heat conditions.\n- Design a visual storytelling tool to raise awareness about microplastics and health.\n- Prototype a low-cost monitoring device for plastics in urban areas.\n\n■ Deliverables\n\n- A prototype/demo (app, model, visualization, or device).\n- A storyboard or use case scenario explaining who benefits and how.\n- A PowerPoint presentation summarizing their solution.\n\n■ Evaluation Criteria\n\n- Innovation and creativity\n- Technical feasibility\n- Community impact and scalability\n- Team collaboration and presentation quality",
    "difficulty": "Hard",
    "image": "solar_pollution.jpg"
  },
  {
    "id": 11,
    "title": "Fayrouz – Echoes from Space",
    "category": "Art & Technology",
    "description": "Welcome to the Echoes from Space Challenge! This bootcamp challenge is designed to inspire innovative solutions that use the healing power of music to support astronauts’ mental health, resilience, and emotional connection during long-duration space missions.\n\n■ Background & Context\nAstronauts face extreme stress, isolation, and long missions in space, which can negatively impact their mental health, mood, and performance. On Earth, music is a proven tool for relaxation, emotional expression, and building connections. So, why not take this healing power into space?\n\n■ The Challenge\nDesign a solution that uses music to support the mental health and well-being of astronauts during long missions. Your project could explore:\n- Creating a space-friendly music platform that provides curated playlists for different moods (relaxation, motivation, sleep).\n- Allowing astronauts to share music with each other and with family on Earth.\n- Researching the impact of specific types of music (like calming voices e.g., Fairouz, or instrumental sounds) on stress reduction in space.\n\n■ Objectives\n- Reduced stress and anxiety levels in astronauts.\n- Enhanced emotional connection with Earth and loved ones.\n- Improved productivity, focus, and resilience during missions.\n\n■ Heartbeat Harmonies System\n- A. Monitors astronauts’ biometric signals (heartbeat, breathing).\n- B. Generates adaptive music or selects songs that synchronize with their current physical and emotional state.\n- C. Creates a shared musical experience by syncing the astronaut’s music with their loved ones on Earth — meaning they can both listen to the same track or heartbeat-generated melody at the same time.\n✨ This transforms music into a bridge across space, reducing feelings of distance and reinforcing emotional bonds.\n\n■ Resources (inside styled card/box)\n- Wearable biometric sensors: to track heartbeat and breathing.\n- AI-based music generator: that adapts music in real-time.\n- Synchronization platform: a secure app that allows astronauts and family members to share the same music stream simultaneously.\n- Optional “Wish Playlist”: astronauts pre-select meaningful songs (e.g., Fairouz for comfort, energetic tracks for motivation).\n\n■ Deliverables\nThis challenge is not only about music — it’s about creating a human connection that transcends space and time. By linking an astronaut’s heartbeat to music and synchronizing it with loved ones on Earth, we turn isolation into togetherness and transform space missions into shared human experiences.\nSupporting astronauts’ mental health with bio-synchronized music fosters emotional stability that is vital for mission success.",
    "difficulty": "Hard",
    "image": "fayrouz.jpg"
  }
]
